frame/postTaggerFrame.xml

a<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webPosRo.uaic/">
	<soapenv:Body>
		<web:parseText_XML>
			<rawTextInput></rawTextInput>
		</web:parseText_XML>
	</soapenv:Body>
</soapenv:Envelope>
